say "Wie ist dein Name?"
pull name
say "Hallo," name"!"

say "Ich verabschiede"; say "mich"

say,
"Oder doch nicht?"

say -
"Hmmm, also doch..."

say -
"Ich werde es mir noch ueberlegen",
"vielleicht"

say -
"Ich werde es mir noch ueberlegen viel"||,
"leicht"

exit 0
