say "Input: "
pull value

if value == 1 then
    say "Das ist eine Eins"
else if value == 2 then
    say "Das ist eine Zwei"
else if value == 3 then
    say "Das ist eine Drei"
else do
    if words(value) > 1 then
        say "Viele Woerter"
    else
        say "Ein Wort"
end
