say "Wie ist dein Geburtsdatum?"

parse pull tag "." monat "." jahr

say "Tag" tag
say "Monat" monat
say "Jahr" jahr

say "Wie ist dein Name"

parse pull vorname nachname

say "Vorname" vorname
say "Nachname" nachname
