say "start"

signal L10

L1:
say "At L1"
signal L9

L2:
say "At L2"
signal L8

L3:
say "At L3"
signal L7

L4:
say "At L4"
signal L6

L5:
say "At L5"
signal L_end

L6:
say "At L6"
signal L5

L7:
say "At L7"
signal L4

L8:
say "At L8"
signal L3

L9:
say "At L9"
signal L2

L10:
say "At L10"
signal L1

L_end:
say "end"
exit
