say "Input: "
pull ?a
say "?a ist" ?a

say "Input: "
pull !a
say "!a ist" !a

say "Input: "
pull !!?
say "!!? ist" !!?

say "Input: "
pull _1
say "_1 ist" _1

say "Input: "
pull !_1
say "!_1 ist" !_1
